Revit 2027 API
PipingSystem.GetPumpSets Method
 Gets the set of element Id's for all pump sets in the system, if any.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetPumpSets()
Public Function GetPumpSets As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetPumpSets()
member GetPumpSets : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 The set of all the pump sets in the system.
See Also
Reference
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace